### Maji Ndogo: From analysis to action
#### Charting the course for Maji Ndogo's water future

Dear Team,

I would like to thank the team for uncovering the corruption of our field workers and letting me know. As you all know, I have no tolerance for
people who look after themselves first, at the cost of everyone else, so I have taken the necessary steps!
Our journey continues, as we aim to convert our data into actionable knowledge. Understanding the situation is one thing, but it's the translation of
that understanding into informed decisions that will truly make a difference.
As we step into this next phase, you will be shaping our raw data into meaningful views - providing essential information to decision-makers. This
will enable us to discern the materials we need, plan our budgets, and identify the areas requiring immediate attention. We're not just analysing
data; we're making it speak in a language that everyone involved in this mission can understand and act upon.
Lastly, we'll be creating job lists for our engineers. Their expertise will be invaluable in tackling the challenges we face, but they can only do their
job effectively when they have clear, data-driven directions.
Remember, each step you take in this process contributes to a larger goal - the transformation of Maji Ndogo. Your diligence and dedication is
instrumental in shaping a brighter future for our community. Thank you for being part of this journey.

All the best,
Aziza

### Joining Pieces Together
Cindi Kunto

Hey! How have you been? I am moving to another project soon, so this might be the last time we work together for a while. I thought you would
appreciate this:

It's really good to see justice taking the front seat. Maji Ndogo is changing, and I think it's because President Naledi gets it—our country's at a tip-
ping point. She's serious about using data and having no room for corruption, and that gives me hope.

We still have a bit of analysis to wrap up, and then we need to create a table to track our progress. Let's start with the last bit of analysis.

So I used to be tempted to put all of the columns from all of the tables in one place/table, and then analyse the data, but on a dataset of this size,
we're going to run into performance issues.

So, we should rather spend a minute thinking about the questions we still have, and create queries to answer them, specifically. Doing this means
that we will only use the data we need to answer our question.


Let's summarise the data we need, and where to find it:
1. All of the information about the location of a water source is in the location table, specifically the town and province of that water source.
2. water_source has the type of source and the number of people served by each source.
2. visits has queue information, and connects source_id to location_id. There were multiple visits to sites, so we need to be careful to
include duplicate data (visit_count > 1 ).
3. well_pollution has information about the quality of water from only wells, so we need to keep that in mind when we join this table.

Previously, we couldn't link provinces and towns to the type of water sources, the number of people served by those sources, queue times, or pol-
lution data, but we can now. So, what type of relationships can we look at?

#### Connecting to MySQL Database

In [1]:
# Configure SQL Magic to display all query results without limiting the output
%config SqlMagic.displaylimit = None

In [2]:
# Load the SQL extension to enable SQL queries within the Jupyter notebook

%load_ext sql

displaylimit: Value None will be treated as 0 (no limit)

Deploy Shiny apps for free on Ploomber Cloud! Learn more: https://ploomber.io/s/signup

In [3]:
# Load the SQL extension for the notebook and connect to the MySQL database
%sql mysql+pymysql://root:salomeK2020!@localhost:3306/md_water_services

Connecting to 'mysql+pymysql://root:***@localhost:3306/md_water_services'

In [4]:
%%sql 
SHOW Tables

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

10 rows affected.

+-----------------------------+
| Tables_in_md_water_services |
+-----------------------------+
|        auditor_report       |
|       data_dictionary       |
|           employee          |
|     global_water_access     |
|      incorrect_records      |
|           location          |
|            visits           |
|        water_quality        |
|         water_source        |
|        well_pollution       |
+-----------------------------+

Things that spring to mind for me:
1. Are there any specific provinces, or towns where some sources are more abundant?
2. We identified that tap_in_home_broken taps are easy wins. Are there any towns where this is a particular problem?

To answer question 1, we will need province_name and town_name from the location table. We also need to know type_of_water_source and
number_of_people_served from the water_source table.

The problem is that the location table uses location_id while water_source only has source_id. So we won't be able to join these tables di-
rectly. But the visits table maps location_id and source_id. So if we use visits as the table we query from, we can join location where

the location_id matches, and water_source where the source_id matches.

Before we can analyse, we need to assemble data into a table first. It is quite complex, but once we're done, the analysis is much simpler!

In [7]:
%%sql
SELECT
    L.province_name,
    L.town_name,
    V.visit_count,
    V.location_id
FROM
    location as L
JOIN
    visits as V
On
    V.location_id = L.location_id
LIMIT 5

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

5 rows affected.

+---------------+-----------+-------------+-------------+
| province_name | town_name | visit_count | location_id |
+---------------+-----------+-------------+-------------+
|     Akatsi    |   Harare  |      1      |  AkHa00000  |
|     Akatsi    |   Harare  |      1      |  AkHa00001  |
|     Akatsi    |   Harare  |      1      |  AkHa00002  |
|     Akatsi    |   Harare  |      1      |  AkHa00003  |
|     Akatsi    |   Harare  |      1      |  AkHa00004  |
+---------------+-----------+-------------+-------------+

In [10]:
%%sql
SELECT
    L.province_name,
    L.town_name,
    V.visit_count,
    V.location_id,
    W.type_of_water_source,
    W.number_of_people_served
FROM
    location as L
JOIN
    visits as V
On
    V.location_id = L.location_id
JOIN
    water_source as W
ON
    W.source_id = V.source_id
LIMIT 5

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

5 rows affected.

+---------------+-----------+-------------+-------------+----------------------+-------------------------+
| province_name | town_name | visit_count | location_id | type_of_water_source | number_of_people_served |
+---------------+-----------+-------------+-------------+----------------------+-------------------------+
|     Akatsi    |   Harare  |      1      |  AkHa00000  |     tap_in_home      |           956           |
|     Akatsi    |   Harare  |      1      |  AkHa00001  |  tap_in_home_broken  |           930           |
|     Akatsi    |   Harare  |      1      |  AkHa00002  |  tap_in_home_broken  |           486           |
|     Akatsi    |   Harare  |      1      |  AkHa00003  |         well         |           364           |
|     Akatsi    |   Harare  |      1      |  AkHa00004  |  tap_in_home_broken  |           942           |
+---------------+-----------+-------------+-------------+----------------------+-------------------------+

Note that there are rows where visit_count > 1. These were the sites our surveyors collected additional information for, but they happened at the
same source/location. For example, add this to your query: WHERE visits.location_id = 'AkHa00103'

In [13]:
%%sql
SELECT
    L.province_name,
    L.town_name,
    V.visit_count,
    V.location_id,
    W.type_of_water_source,
    W.number_of_people_served
FROM
    location as L
JOIN
    visits as V
On
    V.location_id = L.location_id
JOIN
    water_source as W
ON
    W.source_id = V.source_id
WHERE 
    V.location_id = 'AkHa00103'

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

8 rows affected.

+---------------+-----------+-------------+-------------+----------------------+-------------------------+
| province_name | town_name | visit_count | location_id | type_of_water_source | number_of_people_served |
+---------------+-----------+-------------+-------------+----------------------+-------------------------+
|     Akatsi    |   Harare  |      1      |  AkHa00103  |      shared_tap      |           3340          |
|     Akatsi    |   Harare  |      2      |  AkHa00103  |      shared_tap      |           3340          |
|     Akatsi    |   Harare  |      3      |  AkHa00103  |      shared_tap      |           3340          |
|     Akatsi    |   Harare  |      4      |  AkHa00103  |      shared_tap      |           3340          |
|     Akatsi    |   Harare  |      5      |  AkHa00103  |      shared_tap      |           3340          |
|     Akatsi    |   Harare  |      6      |  AkHa00103  |      shared_tap      |           3340          |
|     Akatsi    |   Harare  |      7      |  AkHa00103  |      shared_tap      |           3340          |
|     Akatsi    |   Harare  |      8      |  AkHa00103  |      shared_tap      |           3340          |
+---------------+-----------+-------------+-------------+----------------------+-------------------------+

There you can see what I mean. For one location, there are multiple AkHa00103 records for the same location. If we aggregate, we will include
these rows, so our results will be incorrect. To fix this, we can just select rows where visits.visit_count = 1.

In [15]:
%%sql
SELECT
    L.province_name,
    L.town_name,
    V.visit_count,
    V.location_id,
    W.type_of_water_source,
    W.number_of_people_served
FROM
    location as L
JOIN
    visits as V
On
    V.location_id = L.location_id
JOIN
    water_source as W
ON
    W.source_id = V.source_id
WHERE 
    V.visit_count = 1
LIMIT 5

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

5 rows affected.

+---------------+-----------+-------------+-------------+----------------------+-------------------------+
| province_name | town_name | visit_count | location_id | type_of_water_source | number_of_people_served |
+---------------+-----------+-------------+-------------+----------------------+-------------------------+
|     Sokoto    |   Ilanga  |      1      |  SoIl32582  |        river         |           402           |
|    Kilimani   |   Rural   |      1      |  KiRu28935  |         well         |           252           |
|    Hawassa    |   Rural   |      1      |  HaRu19752  |      shared_tap      |           542           |
|     Akatsi    |   Lusaka  |      1      |  AkLu01628  |         well         |           210           |
|     Akatsi    |   Rural   |      1      |  AkRu03357  |      shared_tap      |           2598          |
+---------------+-----------+-------------+-------------+----------------------+-------------------------+

Ok, now that we verified that the table is joined correctly, we can remove the location_id and visit_count columns.
Add the location_type column from location and time_in_queue from visits to our results set.

In [17]:
%%sql
SELECT
    L.province_name,
    L.town_name,
    W.type_of_water_source,
    L.location_type,
    W.number_of_people_served,
    V.time_in_queue
    
FROM
    location as L
JOIN
    visits as V
On
    V.location_id = L.location_id
JOIN
    water_source as W
ON
    W.source_id = V.source_id
WHERE 
    V.visit_count = 1
LIMIT 5

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

5 rows affected.

+---------------+-----------+----------------------+---------------+-------------------------+---------------+
| province_name | town_name | type_of_water_source | location_type | number_of_people_served | time_in_queue |
+---------------+-----------+----------------------+---------------+-------------------------+---------------+
|     Sokoto    |   Ilanga  |        river         |     Urban     |           402           |       15      |
|    Kilimani   |   Rural   |         well         |     Rural     |           252           |       0       |
|    Hawassa    |   Rural   |      shared_tap      |     Rural     |           542           |       62      |
|     Akatsi    |   Lusaka  |         well         |     Urban     |           210           |       0       |
|     Akatsi    |   Rural   |      shared_tap      |     Rural     |           2598          |       28      |
+---------------+-----------+----------------------+---------------+-------------------------+---------------+

Last one! Now we need to grab the results from the well_pollution table.
This one is a bit trickier. The well_pollution table contained only data for well. If we just use JOIN, we will do an inner join, so that only records
that are in well_pollution AND visits will be joined. We have to use a LEFT JOIN to join theresults from the well_pollution table for well
sources, and will be NULL for all of the rest. Play around with the different JOIN operations to make sure you understand why we used LEFT JOIN.

In [18]:
%%sql
SELECT
    L.province_name,
    L.town_name,
    W.type_of_water_source,
    L.location_type,
    W.number_of_people_served,
    V.time_in_queue,
    WP.results
    
FROM
    location as L
INNER JOIN
    visits as V
On
    V.location_id = L.location_id
INNER JOIN
    water_source as W
ON
    W.source_id = V.source_id
LEFT JOIN
    well_pollution as WP
ON
    WP.source_id=V.source_id
WHERE 
    V.visit_count = 1
LIMIT 5

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

5 rows affected.

+---------------+-----------+----------------------+---------------+-------------------------+---------------+--------------------------+
| province_name | town_name | type_of_water_source | location_type | number_of_people_served | time_in_queue |         results          |
+---------------+-----------+----------------------+---------------+-------------------------+---------------+--------------------------+
|     Sokoto    |   Ilanga  |        river         |     Urban     |           402           |       15      |           None           |
|    Kilimani   |   Rural   |         well         |     Rural     |           252           |       0       | Contaminated: Biological |
|    Hawassa    |   Rural   |      shared_tap      |     Rural     |           542           |       62      |           None           |
|     Akatsi    |   Lusaka  |         well         |     Urban     |           210           |       0       | Contaminated: Biological |
|     Akatsi    |   Rural   |      shared_tap      |     Rural     |           2598          |       28      |           None           |
+---------------+-----------+----------------------+---------------+-------------------------+---------------+--------------------------+

So this table contains the data we need for this analysis. Now we want to analyse the data in the results set. We can either create a CTE, and then
query it, or in my case, I'll make it a VIEW so it is easier to share with you. I'll call it the combined_analysis_table.

In [19]:
%%sql
CREATE VIEW combined_analysis_table AS (
SELECT
    L.province_name,
    L.town_name,
    W.type_of_water_source,
    L.location_type,
    W.number_of_people_served,
    V.time_in_queue,
    WP.results
    
FROM
    location as L
INNER JOIN
    visits as V
On
    V.location_id = L.location_id
INNER JOIN
    water_source as W
ON
    W.source_id = V.source_id
LEFT JOIN
    well_pollution as WP
ON
    WP.source_id=V.source_id
WHERE 
    V.visit_count = 1);

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

++
||
++
++

This view creates a "table" that pulls all of the important information from different tables into one. You may notice our query is starting to slow
down because it involves a lot of steps, and runs on 60000 rows of data.

### The Last Analysis

We're building another pivot table! This time, we want to break down our data into provinces or towns and source types. If we understand where
the problems are, and what we need to improve at those locations, we can make an informed decision on where to send our repair teams.

We did most of this before, so I'll give you the queries I used, explain them a bit, and then we'll look at the results.

The queries I am sharing with you today are not formatted well because I am trying to fit them into my chat messages, but make sure you add com-
ments, and document your code well so you can use it again.

In [22]:
%%sql
WITH province_totals AS (#This CTE calculates the population of each province
SELECT
    province_name,
    SUM(number_of_people_served) AS total_ppl_serv
FROM
    combined_analysis_table
GROUP BY
    province_name
)
SELECT
    ct.province_name,
#These case statements create columns for each type of source.
#The results are aggregated and percentages are calculated
ROUND((SUM(CASE WHEN type_of_water_source = 'river'
THEN number_of_people_served ELSE 0 END) * 100.0 / pt.total_ppl_serv), 0) AS river,
ROUND((SUM(CASE WHEN type_of_water_source = 'shared_tap'
THEN number_of_people_served ELSE 0 END) * 100.0 / pt.total_ppl_serv), 0) AS shared_tap,
ROUND((SUM(CASE WHEN type_of_water_source = 'tap_in_home'
THEN number_of_people_served ELSE 0 END) * 100.0 / pt.total_ppl_serv), 0) AS tap_in_home,
ROUND((SUM(CASE WHEN type_of_water_source = 'tap_in_home_broken'
THEN number_of_people_served ELSE 0 END) * 100.0 / pt.total_ppl_serv), 0) AS tap_in_home_broken,
ROUND((SUM(CASE WHEN type_of_water_source = 'well'
THEN number_of_people_served ELSE 0 END) * 100.0 / pt.total_ppl_serv), 0) AS well
FROM
combined_analysis_table ct
JOIN
province_totals pt ON ct.province_name = pt.province_name
GROUP BY
ct.province_name
ORDER BY
ct.province_name;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

5 rows affected.

+---------------+-------+------------+-------------+--------------------+------+
| province_name | river | shared_tap | tap_in_home | tap_in_home_broken | well |
+---------------+-------+------------+-------------+--------------------+------+
|     Akatsi    |   5   |     49     |      14     |         10         |  23  |
|     Amanzi    |   3   |     38     |      28     |         24         |  7   |
|    Hawassa    |   4   |     43     |      15     |         15         |  24  |
|    Kilimani   |   8   |     47     |      13     |         12         |  20  |
|     Sokoto    |   21  |     38     |      16     |         10         |  15  |
+---------------+-------+------------+-------------+--------------------+------+

Province_totals is a CTE that calculates the sum of all the people surveyed grouped by province. If you replace the query above with this one:

Run the query and see if you can spot any of the following patterns:

• Look at the river column, Sokoto has the largest population of people drinking river water. We should send our drilling equipment to Sokoto
first, so people can drink safe filtered water from a well.

• The majority of water from Amanzi comes from taps, but half of these home taps don't work because the infrastructure is broken. We need to
send out engineering teams to look at the infrastructure in Amanzi first. Fixing a large pump, treatment plant or reservoir means that
thousands of people will have running water. This means they will also not have to queue for water, so we improve two things at once.